### AWS UAT App plan Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/c7ad72bd-cd3c-4c12-9147-1fd98ac95b9a/terraform-bin show -no-color plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.s3_object_uat.aws_s3_bucket_object.this["about.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "about.html"
      ~ source_hash            = "a15271053ced7de0d90829652fb727f0" -> "2f76a2c5a447e5afb362e2b3a1f4f967"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["articles.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "articles.html"
      ~ source_hash            = "cb87bbf3978ef6a9bc6a1ce13942d4d1" -> "f1da0856dab8b2a1a4b90b99b8cf451a"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["articles/learning-to-unit-test-en.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "articles/learning-to-unit-test-en.html"
      ~ source_hash            = "cab9cfc4c827a864f560b9b8c6fcd8b5" -> "3990edc814d0e69a0724c8946f5428bf"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["articles/learning-to-unit-test-es.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "articles/learning-to-unit-test-es.html"
      ~ source_hash            = "c6f2f69b1f7a2b843a9cb7fa2ed3f817" -> "a79e302b4b644feb9edbf9e7273d7bc0"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-1b452a57.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/About-1b452a57.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/About-1b452a57.js"
      + source_hash            = "e4851df3428be965f3e0041f772a58c1"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-b2b111e4.js"] will be destroyed
  # (because key ["assets/About-b2b111e4.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "5b050c5a9c0fe3a6d744add87b32933e" -> null
      - force_destroy          = true -> null
      - id                     = "assets/About-b2b111e4.js" -> null
      - key                    = "assets/About-b2b111e4.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/About-b2b111e4.js" -> null
      - source_hash            = "5b050c5a9c0fe3a6d744add87b32933e" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-35aa4823.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/ArticleLayouts-35aa4823.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/ArticleLayouts-35aa4823.js"
      + source_hash            = "754d38199b05e677c61987b09ef75088"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-e0442dce.js"] will be destroyed
  # (because key ["assets/ArticleLayouts-e0442dce.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "f79258d463f0146248630258a319c2bc" -> null
      - force_destroy          = true -> null
      - id                     = "assets/ArticleLayouts-e0442dce.js" -> null
      - key                    = "assets/ArticleLayouts-e0442dce.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/ArticleLayouts-e0442dce.js" -> null
      - source_hash            = "f79258d463f0146248630258a319c2bc" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-4f38065c.js"] will be destroyed
  # (because key ["assets/Articles-4f38065c.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "ed3e79b559681bde95283db2cdb5f4ff" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Articles-4f38065c.js" -> null
      - key                    = "assets/Articles-4f38065c.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Articles-4f38065c.js" -> null
      - source_hash            = "ed3e79b559681bde95283db2cdb5f4ff" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-87c7dedf.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Articles-87c7dedf.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Articles-87c7dedf.js"
      + source_hash            = "4777d4f692d5e4297098bf839c7572b9"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-0f119c3f.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Landing-0f119c3f.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Landing-0f119c3f.js"
      + source_hash            = "725717ca160855774c9129761f8ed67e"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-61a40d7f.css"] will be destroyed
  # (because key ["assets/Landing-61a40d7f.css"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "text/css" -> null
      - etag                   = "4b4b60871b0c8cdca6fcf9d7e9188891" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Landing-61a40d7f.css" -> null
      - key                    = "assets/Landing-61a40d7f.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Landing-61a40d7f.css" -> null
      - source_hash            = "4b4b60871b0c8cdca6fcf9d7e9188891" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-a96b032e.css"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/css"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Landing-a96b032e.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Landing-a96b032e.css"
      + source_hash            = "8c544421623ccc444b2ebb24e21604c6"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-eaf6275a.js"] will be destroyed
  # (because key ["assets/Landing-eaf6275a.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "e17e97f9b0ae2ce2333c4a421f1de774" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Landing-eaf6275a.js" -> null
      - key                    = "assets/Landing-eaf6275a.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Landing-eaf6275a.js" -> null
      - source_hash            = "e17e97f9b0ae2ce2333c4a421f1de774" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-79951129.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/PDF-79951129.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/PDF-79951129.js"
      + source_hash            = "86ef3f2faf4eda49b52d3584dd6f3c03"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-8e379427.js"] will be destroyed
  # (because key ["assets/PDF-8e379427.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "7d1efdf8e797dfe032364614f37ba7a2" -> null
      - force_destroy          = true -> null
      - id                     = "assets/PDF-8e379427.js" -> null
      - key                    = "assets/PDF-8e379427.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/PDF-8e379427.js" -> null
      - source_hash            = "7d1efdf8e797dfe032364614f37ba7a2" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-d26b4436.css"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/css"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/PDF-d26b4436.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/PDF-d26b4436.css"
      + source_hash            = "b30914c960afd765971c03c1acb96ba3"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-ed9e0e67.css"] will be destroyed
  # (because key ["assets/PDF-ed9e0e67.css"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "text/css" -> null
      - etag                   = "6fc87daab214fb58303b3d530c9b2001" -> null
      - force_destroy          = true -> null
      - id                     = "assets/PDF-ed9e0e67.css" -> null
      - key                    = "assets/PDF-ed9e0e67.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/PDF-ed9e0e67.css" -> null
      - source_hash            = "6fc87daab214fb58303b3d530c9b2001" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-98b1b8ec.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Start-98b1b8ec.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Start-98b1b8ec.js"
      + source_hash            = "e1bdfa60d52e69dfb6a44a4298003031"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-b54dfad9.js"] will be destroyed
  # (because key ["assets/Start-b54dfad9.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "6c874cdc7f0d1f41b3c05c07c0e0abe0" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Start-b54dfad9.js" -> null
      - key                    = "assets/Start-b54dfad9.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Start-b54dfad9.js" -> null
      - source_hash            = "6c874cdc7f0d1f41b3c05c07c0e0abe0" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartNav-139e3675.js"] will be destroyed
  # (because key ["assets/StartNav-139e3675.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "5e97c7e0708883d62d42891789274ae3" -> null
      - force_destroy          = true -> null
      - id                     = "assets/StartNav-139e3675.js" -> null
      - key                    = "assets/StartNav-139e3675.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/StartNav-139e3675.js" -> null
      - source_hash            = "5e97c7e0708883d62d42891789274ae3" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartNav-8e766fdc.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/StartNav-8e766fdc.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/StartNav-8e766fdc.js"
      + source_hash            = "ace1f40ca3f08bfb9b56f5f697912144"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/app-75e00e53.js"] will be destroyed
  # (because key ["assets/app-75e00e53.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "b94fc7c2524ff0b5f0b2ef40a6278a91" -> null
      - force_destroy          = true -> null
      - id                     = "assets/app-75e00e53.js" -> null
      - key                    = "assets/app-75e00e53.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/app-75e00e53.js" -> null
      - source_hash            = "b94fc7c2524ff0b5f0b2ef40a6278a91" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/app-db3615a1.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/app-db3615a1.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/app-db3615a1.js"
      + source_hash            = "65f6fb758440aff9f33912a15988713f"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/github_profile_pic-3f4ad9de.js"] will be destroyed
  # (because key ["assets/github_profile_pic-3f4ad9de.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "5c3ee316aff3428460aeba1b29409701" -> null
      - force_destroy          = true -> null
      - id                     = "assets/github_profile_pic-3f4ad9de.js" -> null
      - key                    = "assets/github_profile_pic-3f4ad9de.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/github_profile_pic-3f4ad9de.js" -> null
      - source_hash            = "5c3ee316aff3428460aeba1b29409701" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/github_profile_pic-e8fc6c1b.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/github_profile_pic-e8fc6c1b.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/github_profile_pic-e8fc6c1b.js"
      + source_hash            = "ec3072955d336eac324f92874795358e"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-49de4352.js"] will be destroyed
  # (because key ["assets/index.es-49de4352.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "cd575fc59030b6031b7a64f5239f4672" -> null
      - force_destroy          = true -> null
      - id                     = "assets/index.es-49de4352.js" -> null
      - key                    = "assets/index.es-49de4352.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/index.es-49de4352.js" -> null
      - source_hash            = "cd575fc59030b6031b7a64f5239f4672" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-f23aafa8.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/index.es-f23aafa8.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/index.es-f23aafa8.js"
      + source_hash            = "de4ed646a2f6d212d2858e6187c588b8"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/jquery.easing-1c7b97b0.js"] will be destroyed
  # (because key ["assets/jquery.easing-1c7b97b0.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "f3d9b4de10eee1a4926efb0f3b6f3318" -> null
      - force_destroy          = true -> null
      - id                     = "assets/jquery.easing-1c7b97b0.js" -> null
      - key                    = "assets/jquery.easing-1c7b97b0.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/jquery.easing-1c7b97b0.js" -> null
      - source_hash            = "f3d9b4de10eee1a4926efb0f3b6f3318" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/jquery.easing-688c0ff1.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/jquery.easing-688c0ff1.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/jquery.easing-688c0ff1.js"
      + source_hash            = "f2545514c0d11a8c0adaa3d366695f6b"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["index.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "index.html"
      ~ source_hash            = "023f647a3928e4b15d7f083b8eb45a7a" -> "0069fcea5dcfd7570bee775835cc2aa4"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["pdf.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "pdf.html"
      ~ source_hash            = "3b27a9d704eec81e336231afd3e829b1" -> "1f1119c9191eb177bb2e6523a9e79e11"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["resume.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "resume.html"
      ~ source_hash            = "fcce7436a457b1531b88972520851a16" -> "89cadf8ff37982fc9790b9dec1c4e8a0"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["sitemap.xml"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "sitemap.xml"
      ~ source_hash            = "a3de8bf8e028d099977f690d5c9ad8bc" -> "d66fabf9b99f8fef685c5c9a3f6eb79b"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["ssr-manifest.json"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "ssr-manifest.json"
      ~ source_hash            = "45660e3c355a528a33ca6c92ff93ad38" -> "c52d26cdb57b1d60ecfea66b99da8fdb"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

Plan: 13 to add, 9 to change, 13 to destroy.

Changes to Outputs:
  ~ s3_bucket_object_etags       = [
        "8274f68f0ec4b7bd6eab988987eaf299",
      - "6f44660556ddd53dc5f6e0ac850dc2bc",
      - "9d36fced006090c98d2f60346bc0ce8b",
      - "1eb2d3a29786c6e04c6486a432103cd5",
      - "9eda5db27ec59fdf28c2410c57672fb4",
      - "5b050c5a9c0fe3a6d744add87b32933e",
      - "f79258d463f0146248630258a319c2bc",
      - "ed3e79b559681bde95283db2cdb5f4ff",
      + "a15271053ced7de0d90829652fb727f0",
      + "cb87bbf3978ef6a9bc6a1ce13942d4d1",
      + "cab9cfc4c827a864f560b9b8c6fcd8b5",
      + "c6f2f69b1f7a2b843a9cb7fa2ed3f817",
      + null,
      + null,
      + null,
        "d254e9f4850a323e5ea30df3ac31964d",
      - "4b4b60871b0c8cdca6fcf9d7e9188891",
      - "e17e97f9b0ae2ce2333c4a421f1de774",
      - "7d1efdf8e797dfe032364614f37ba7a2",
      - "6fc87daab214fb58303b3d530c9b2001",
      - "6c874cdc7f0d1f41b3c05c07c0e0abe0",
      - "5e97c7e0708883d62d42891789274ae3",
      + null,
      + null,
      + null,
      + null,
      + null,
      + null,
        "35bc2af385e37e6def98966cb8b61301",
      - "b94fc7c2524ff0b5f0b2ef40a6278a91",
      + null,
        "e60911495dba8bb96def57539a94e9cf",
        # (12 unchanged elements hidden)
        "fee66e712a8a08eef5805a46892932ad",
      - "5c3ee316aff3428460aeba1b29409701",
        "a85d8d094e6d9a7903c5829c0ed09432",
      + null,
        "955bf9b222a46a0897ad2d52916463de",
        "4936e3453a7e6bff7c1db8961e8c9697",
      - "cd575fc59030b6031b7a64f5239f4672",
      - "f3d9b4de10eee1a4926efb0f3b6f3318",
      + null,
      + null,
        "3af47f89e61fe763b909c1fabc4c4083",
        # (5 unchanged elements hidden)
        "15789dada2974fe2e62d763285aa97f0",
      - "4138c680c0d56504a3ebefa87f40b40f",
      - "9dfe31a4fdf24121bb1bfc5a69a8bcc9",
      + "023f647a3928e4b15d7f083b8eb45a7a",
      + "3b27a9d704eec81e336231afd3e829b1",
        "2768def6521a03cb200e18c553ed68e3",
        # (3 unchanged elements hidden)
        "20a2db7d5040eb315e6acf49c6983de9",
      - "33bec3661d301eb046859dcbe5e0bd80",
      + "fcce7436a457b1531b88972520851a16",
        "bc7d77685e5bf6193fe295a198511188",
        "5eaf74d1c43d30e0af743b68a3f48504",
      - "b754ae7c877f8633cf26f7bd3877fcd7",
      + "a3de8bf8e028d099977f690d5c9ad8bc",
        "45660e3c355a528a33ca6c92ff93ad38",
    ]
  ~ s3_bucket_object_ids         = [
        # (4 unchanged elements hidden)
        "articles/learning-to-unit-test-es.html",
      - "assets/About-b2b111e4.js",
      - "assets/ArticleLayouts-e0442dce.js",
      - "assets/Articles-4f38065c.js",
      + null,
      + null,
      + null,
        "assets/Articles-cdca7afd.css",
      - "assets/Landing-61a40d7f.css",
      - "assets/Landing-eaf6275a.js",
      - "assets/PDF-8e379427.js",
      - "assets/PDF-ed9e0e67.css",
      - "assets/Start-b54dfad9.js",
      - "assets/StartNav-139e3675.js",
      + null,
      + null,
      + null,
      + null,
      + null,
      + null,
        "assets/StartNav-cb1e6734.css",
      - "assets/app-75e00e53.js",
      + null,
        "assets/azure_devicon_forest_green-ee780a3a.svg",
        # (12 unchanged elements hidden)
        "assets/fontawesome-webfont-ba0c59de.woff",
      - "assets/github_profile_pic-3f4ad9de.js",
        "assets/github_profile_pic-66b10136.jpg",
      + null,
        "assets/html2canvas.esm-0a33ed42.js",
        "assets/index-2883df99.css",
      - "assets/index.es-49de4352.js",
      - "assets/jquery.easing-1c7b97b0.js",
      + null,
      + null,
        "assets/powershell_devicon_forest_green-f06a1fda.svg",
        # (18 unchanged elements hidden)
    ]
  ~ s3_bucket_object_keys_ids    = [
        # (4 unchanged elements hidden)
        {
            id  = "articles/learning-to-unit-test-es.html"
            key = "articles/learning-to-unit-test-es.html"
        },
      ~ {
          - id  = "assets/About-b2b111e4.js"
          ~ key = "assets/About-b2b111e4.js" -> "assets/About-1b452a57.js"
        },
      ~ {
          - id  = "assets/ArticleLayouts-e0442dce.js"
          ~ key = "assets/ArticleLayouts-e0442dce.js" -> "assets/ArticleLayouts-35aa4823.js"
        },
      ~ {
          - id  = "assets/Articles-4f38065c.js"
          ~ key = "assets/Articles-4f38065c.js" -> "assets/Articles-87c7dedf.js"
        },
        {
            id  = "assets/Articles-cdca7afd.css"
            key = "assets/Articles-cdca7afd.css"
        },
      ~ {
          - id  = "assets/Landing-61a40d7f.css"
          ~ key = "assets/Landing-61a40d7f.css" -> "assets/Landing-0f119c3f.js"
        },
      ~ {
          - id  = "assets/Landing-eaf6275a.js"
          ~ key = "assets/Landing-eaf6275a.js" -> "assets/Landing-a96b032e.css"
        },
      ~ {
          - id  = "assets/PDF-8e379427.js"
          ~ key = "assets/PDF-8e379427.js" -> "assets/PDF-79951129.js"
        },
      ~ {
          - id  = "assets/PDF-ed9e0e67.css"
          ~ key = "assets/PDF-ed9e0e67.css" -> "assets/PDF-d26b4436.css"
        },
      ~ {
          - id  = "assets/Start-b54dfad9.js"
          ~ key = "assets/Start-b54dfad9.js" -> "assets/Start-98b1b8ec.js"
        },
      ~ {
          - id  = "assets/StartNav-139e3675.js"
          ~ key = "assets/StartNav-139e3675.js" -> "assets/StartNav-8e766fdc.js"
        },
        {
            id  = "assets/StartNav-cb1e6734.css"
            key = "assets/StartNav-cb1e6734.css"
        },
      ~ {
          - id  = "assets/app-75e00e53.js"
          ~ key = "assets/app-75e00e53.js" -> "assets/app-db3615a1.js"
        },
        {
            id  = "assets/azure_devicon_forest_green-ee780a3a.svg"
            key = "assets/azure_devicon_forest_green-ee780a3a.svg"
        },
        # (12 unchanged elements hidden)
        {
            id  = "assets/fontawesome-webfont-ba0c59de.woff"
            key = "assets/fontawesome-webfont-ba0c59de.woff"
        },
      - {
          - id  = "assets/github_profile_pic-3f4ad9de.js"
          - key = "assets/github_profile_pic-3f4ad9de.js"
        },
        {
            id  = "assets/github_profile_pic-66b10136.jpg"
            key = "assets/github_profile_pic-66b10136.jpg"
        },
      + {
          + key = "assets/github_profile_pic-e8fc6c1b.js"
        },
        {
            id  = "assets/html2canvas.esm-0a33ed42.js"
            key = "assets/html2canvas.esm-0a33ed42.js"
        },
        {
            id  = "assets/index-2883df99.css"
            key = "assets/index-2883df99.css"
        },
      ~ {
          - id  = "assets/index.es-49de4352.js"
          ~ key = "assets/index.es-49de4352.js" -> "assets/index.es-f23aafa8.js"
        },
      ~ {
          - id  = "assets/jquery.easing-1c7b97b0.js"
          ~ key = "assets/jquery.easing-1c7b97b0.js" -> "assets/jquery.easing-688c0ff1.js"
        },
        {
            id  = "assets/powershell_devicon_forest_green-f06a1fda.svg"
            key = "assets/powershell_devicon_forest_green-f06a1fda.svg"
        },
        # (18 unchanged elements hidden)
    ]
  ~ s3_bucket_object_version_ids = [
        "",
      + null,
      + null,
      + null,
      + null,
      + null,
      + null,
      + null,
        "",
      + null,
      + null,
      + null,
      + null,
      + null,
      + null,
        "",
      + null,
        "",
        # (13 unchanged elements hidden)
        "",
      + null,
        "",
        "",
      + null,
      + null,
        "",
        # (5 unchanged elements hidden)
        "",
      + null,
      + null,
        "",
        # (3 unchanged elements hidden)
        "",
      + null,
        "",
        "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      + null,
      + null,
    ]
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["about.html"] will be updated in-place%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "about.html"%0A      ~ source_hash            = "a15271053ced7de0d90829652fb727f0" -> "2f76a2c5a447e5afb362e2b3a1f4f967"%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["articles.html"] will be updated in-place%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "articles.html"%0A      ~ source_hash            = "cb87bbf3978ef6a9bc6a1ce13942d4d1" -> "f1da0856dab8b2a1a4b90b99b8cf451a"%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["articles/learning-to-unit-test-en.html"] will be updated in-place%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "articles/learning-to-unit-test-en.html"%0A      ~ source_hash            = "cab9cfc4c827a864f560b9b8c6fcd8b5" -> "3990edc814d0e69a0724c8946f5428bf"%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["articles/learning-to-unit-test-es.html"] will be updated in-place%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "articles/learning-to-unit-test-es.html"%0A      ~ source_hash            = "c6f2f69b1f7a2b843a9cb7fa2ed3f817" -> "a79e302b4b644feb9edbf9e7273d7bc0"%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-1b452a57.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/About-1b452a57.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/About-1b452a57.js"%0A      + source_hash            = "e4851df3428be965f3e0041f772a58c1"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-b2b111e4.js"] will be destroyed%0A  # (because key ["assets/About-b2b111e4.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.shortpoet.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "5b050c5a9c0fe3a6d744add87b32933e" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/About-b2b111e4.js" -> null%0A      - key                    = "assets/About-b2b111e4.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/assets/About-b2b111e4.js" -> null%0A      - source_hash            = "5b050c5a9c0fe3a6d744add87b32933e" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-35aa4823.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/ArticleLayouts-35aa4823.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/ArticleLayouts-35aa4823.js"%0A      + source_hash            = "754d38199b05e677c61987b09ef75088"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-e0442dce.js"] will be destroyed%0A  # (because key ["assets/ArticleLayouts-e0442dce.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.shortpoet.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "f79258d463f0146248630258a319c2bc" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/ArticleLayouts-e0442dce.js" -> null%0A      - key                    = "assets/ArticleLayouts-e0442dce.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/assets/ArticleLayouts-e0442dce.js" -> null%0A      - source_hash            = "f79258d463f0146248630258a319c2bc" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-4f38065c.js"] will be destroyed%0A  # (because key ["assets/Articles-4f38065c.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.shortpoet.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "ed3e79b559681bde95283db2cdb5f4ff" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/A
  ```
  </details>
  *Pusher: @shortpoet, Action: `pull_request`, Working Directory: ``, Workflow: `App Infra`*